Yuanzjls/Video_Player_stm32f769_disco/Core/Src/main.cpp
	  ulNotifiedValue = xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, 400 );
	  if (ulNotifiedValue & 0x01)
	  {

			priority = uxTaskPriorityGet( NULL );
			vTaskPrioritySet(NULL, 0);
			wm8994_SetVolume(AUDIO_I2C_ADDRESS, volume);
			vTaskPrioritySet(NULL, priority);

	  }
	  BSP_LED_Toggle(LED2);
    //vTaskDelay(400);
  }
}


static void vTaskTouchEx(void *pvParameters)
{
	volatile uint32_t ulNotificationValue;
	TS_StateTypeDef  ts;
	static volatile GUI_PID_STATE TS_State = {0, 0, 0, 0};
	while(1)
	{
		ulNotificationValue = ulTaskNotifyTake( pdTRUE, 50 );


		if (ulNotificationValue==1)
		{
			BSP_TS_GetState((TS_StateTypeDef *)&ts);
			TS_State.Pressed = 1;
			TS_State.x = ts.touchX[0];
			TS_State.y = ts.touchY[0];
			GUI_PID_StoreState((const GUI_PID_STATE*)&TS_State);
		}
		else
		{
			if (TS_State.Pressed == 1)
			{
				TS_State.Pressed = 0;
				TS_State.x = -1;
				TS_State.y = -1;
				GUI_PID_StoreState((const GUI_PID_STATE*)&TS_State);;
			}
		}

	}
}
unsigned int RetrieveMP3Data(void * pMP3CompressedData,
unsigned int nMP3DataSizeInChars,
void * token)
{
	UINT nData_Read;

	f_read((FIL*)token, pMP3CompressedData, nMP3DataSizeInChars, &nData_Read);
	return nData_Read;
}

AudioTime Total_AudioTime;
extern char time_char[18];
WM_HWIN xhWin;
FATFS fs;
char filename[256];
extern uint8_t Play_Status;
extern uint8_t Repeat_Status;
static void vTaskMusic(void *pvParameters)
{
  FRESULT fr;
  DIR dj;
  FILINFO fno;

  unsigned int length=0;
  uint32_t ulNotifiedValue;

  WM_MESSAGE p;


  if (f_mount(&fs,(char*)"",1) == FR_OK)
  {
	fr = f_findfirst(&dj, &fno, "/Music", "*.wav");
	strcpy(filename, "/Music/");
	strcpy(&filename[7], fno.fname);
	if (fr == FR_OK && fno.fname[0])
	{

		f_open(&fi, filename, FA_READ);
		f_read(&fi, (void *)&Wheader, sizeof(Wheader), &length);
		f_lseek(&fi, PLAY_HEADER);
		f_read(&fi, buff, block_size*2, &length);

		Total_AudioTime.total_second = (f_size(&fi) - PLAY_HEADER) / 4 / Wheader.Samplerate;
		Total_AudioTime.second = Total_AudioTime.total_second % 60;
		Total_AudioTime.minute = Total_AudioTime.total_second / 60;
		Total_AudioTime.current_progress_insecond = 0;
		Total_AudioTime.current_minute = Total_AudioTime.current_progress_insecond / 60;
		Total_AudioTime.current_second = Total_AudioTime.current_progress_insecond % 60;

		sprintf(time_char, "%02d:%02d / %02d:%02d", Total_AudioTime.current_minute, Total_AudioTime.current_second,
						Total_AudioTime.minute, Total_AudioTime.second);
		Playback_Init(Wheader.Samplerate);
		xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, portMAX_DELAY);
		HAL_SAI_Transmit_DMA(&SaiHandle, (uint8_t *)buff, block_size);
		p.MsgId = WM_USER_UPDATEFILENAME;
		p.Data.p = fno.fname;
		p.hWin = xhWin;

		WM_SendMessage(xhWin, &p);
        while(1)
        {
          xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, 400 );
          if (ulNotifiedValue)
          {
            if (ulNotifiedValue  & 0x01)
            {
              f_read(&fi, &buff[block_size/2], block_size, &length);
            }   
            if (ulNotifiedValue  & 0x02)
            {
              f_read(&fi, &buff[0], block_size, &length);
            }
            if (ulNotifiedValue & 0x04)
            {
            	f_lseek(&fi, PLAY_HEADER +
            			Total_AudioTime.current_progress_insecond * 4
						* Wheader.Samplerate);
            	f_read(&fi, buff, block_size*2, &length);
            	Total_AudioTime.current_progress_insecond = (f_tell(&fi) - PLAY_HEADER) / 4 / Wheader.Samplerate;
            }
            if (ulNotifiedValue  & 0x07)
            {
            	Total_AudioTime.current_progress_insecond = (f_tell(&fi) - PLAY_HEADER) / 4 / Wheader.Samplerate;
				Total_AudioTime.current_minute = Total_AudioTime.current_progress_insecond / 60;
				Total_AudioTime.current_second = Total_AudioTime.current_progress_insecond % 60;
            	sprintf(time_char, "%02d:%02d / %02d:%02d", Total_AudioTime.current_minute, Total_AudioTime.current_second,
            							Total_AudioTime.minute, Total_AudioTime.second);
            }
            if (ulNotifiedValue & 0x08 )
            {
            	if (Play_Status == 1)
            	{
            		wm8994_Resume(AUDIO_I2C_ADDRESS);
					HAL_SAI_DMAResume(&SaiHandle);
            	}
            	else
            	{
            		wm8994_Pause(AUDIO_I2C_ADDRESS);
            		HAL_SAI_DMAPause(&SaiHandle);
            	}
            }
            if ((f_tell(&fi) == f_size(&fi) && Repeat_Status == 0) || ulNotifiedValue & 0x10)
            {
            	fr = f_findnext(&dj, &fno);
            	if (fr == FR_OK && fno.fname[0])
            	{
            		f_close(&fi);
            		strcpy(&filename[7], fno.fname);
            		f_open(&fi, filename, FA_READ);
					f_read(&fi, (void *)&Wheader, sizeof(Wheader), &length);
					f_lseek(&fi, PLAY_HEADER);
					f_read(&fi, buff, block_size*2, &length);
					Total_AudioTime.total_second = (f_size(&fi) - PLAY_HEADER) / 4 / Wheader.Samplerate;
					Total_AudioTime.second = Total_AudioTime.total_second % 60;
					Total_AudioTime.minute = Total_AudioTime.total_second / 60;
					Total_AudioTime.current_progress_insecond = 0;
					Total_AudioTime.current_minute = Total_AudioTime.current_progress_insecond / 60;
					Total_AudioTime.current_second = Total_AudioTime.current_progress_insecond % 60;
					WM_SendMessage(xhWin, &p);
					wm8994_SetFrequency(AUDIO_I2C_ADDRESS, Wheader.Samplerate);
            	}
            	else
            	{
            		f_closedir(&dj);
            		f_lseek(&fi, f_size(&fi));
            		fr = f_findfirst(&dj, &fno, "/Music", "*.wav");
            	}
            }
            if (f_tell(&fi) == f_size(&fi) && Repeat_Status == 1)
            {
            	f_lseek(&fi, PLAY_HEADER);
            }
            BSP_LED_Toggle(LED_RED);
          }
        }
	}
  }
  else
  {
	  while(1)
	  {
		  BSP_LED_Toggle(LED_RED);
		  vTaskDelay(2000);
	  }
  }
}

uint8_t    FrameBuffer[AVI_VIDEO_BUF_SIZE];


int Get_data(uint8_t *buff, uint32_t Datalength)
{
	unsigned int length;

	f_read(&fi, buff, Datalength, &length);
	return length;
}
extern AVI_INFO Avix;
void  vTaskGUI(void *pvParameters)
{
	unsigned int length;
	FRESULT res;
	FILINFO fno;
	DIR dj;
	volatile AVISTATUS avi_res;
	HW_JPEG_Init();
	uint32_t offset, last_time, current_frame, next_frame_time, frame_per_ms, audio_pr;
	uint8_t *buf_pr = (uint8_t*)buff;


