Yuanzjls/Video_Player_stm32f769_disco/Core/Src/main.cpp
	BSP_SD_Init();
	if (f_mount(&fs,(char*)"",1) == FR_OK)
	{

		f_open(&fi, "/Avi/inuyasha.avi", FA_READ);
		f_read(&fi, (U8 *)FrameBuffer, AVI_VIDEO_BUF_SIZE, &length);
		avi_res = _AVI_Init(FrameBuffer, AVI_VIDEO_BUF_SIZE);
		offset = _AVI_SearchID(FrameBuffer, AVI_VIDEO_BUF_SIZE, (U8*)"movi");
		_Avi_Get_Streaminfo(FrameBuffer + offset + 4);
		f_lseek(&fi, offset+12);
		Playback_Init(Avix.SampleRate);
		HAL_SAI_Transmit_DMA(&SaiHandle, (uint8_t *)buff, block_size);
		current_frame=0;
		frame_per_ms = Avix.SecPerFrame/1000;
		next_frame_time = 0;
		audio_pr = 0;
		last_time = osKernelSysTick();
		while(f_size(&fi)!=f_tell(&fi) && Avix.StreamSize<=AVI_VIDEO_BUF_SIZE)
		{

			if (AVI_AUDS_FLAG==Avix.StreamID)
			{
				f_read(&fi, (U8 *)FrameBuffer, Avix.StreamSize+8, &length);
				if (audio_pr+Avix.StreamSize>(block_size<<1))
				{
					audio_pr = 0;
				}
				memcpy(buf_pr+audio_pr, (U8 *)FrameBuffer, Avix.StreamSize);
				audio_pr+=Avix.StreamSize;
				_Avi_Get_Streaminfo(FrameBuffer + Avix.StreamSize);
				//vTaskDelay(20);
			}
			else if (Avix.StreamID == AVI_VIDS_FLAG)
			{
				f_read(&fi, (U8 *)FrameBuffer, Avix.StreamSize+8, &length);
				if (Avix.StreamSize >0)
				{
					if ((osKernelSysTick()-last_time) <= (next_frame_time-60))
					{
						if (HW_JPEG_Draw_timeout(Avix.StreamSize, next_frame_time-(osKernelSysTick()-last_time)-55))
						{
//							HW_JPEG_DeInit();
//							HW_JPEG_Init();
						}
						else
						{
							current_frame++;
						}
						BSP_LED_Toggle(LED_RED);
					}
					next_frame_time += frame_per_ms;
				}

				_Avi_Get_Streaminfo(FrameBuffer + Avix.StreamSize);
			}

		}
		f_close(&fi);

	}
	while(1)
	{
		BSP_LED_Toggle(LED_RED);
		vTaskDelay(500);
	}

}
//higher number, higher priority
static void AppTaskCreate(void)
{
  xTaskCreate(vTaskVolume, "TaskVolume", 512, NULL, 3, &xTaskVolume);
  //xTaskCreate(vTaskMusic, "TaskMusic", 2048, NULL, 4, &xTaskMusic);
  xTaskCreate(vTaskGUI, "TaskGUI", 10240, NULL, 1, &xTaskGUI);
  xTaskCreate(vTaskTouchEx, "TaskTouchEx", 512, NULL, 2, &xTaskTouchEx);


}
static void MPU_Config(void)
{
	MPU_Region_InitTypeDef MPU_InitStruct;

	  /* Disable the MPU */
	  HAL_MPU_Disable();

	  /* Configure the MPU as Normal Non Cacheable for the SRAM1 and SRAM2 */
	  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
	  MPU_InitStruct.BaseAddress = 0x20020000;
	  MPU_InitStruct.Size = MPU_REGION_SIZE_512KB;
	  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
	  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
	  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
	  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
	  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
	  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
	  MPU_InitStruct.SubRegionDisable = 0x00;
	  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

	  HAL_MPU_ConfigRegion(&MPU_InitStruct);

	  /* Configure the MPU attributes as Non Cacheable and Non Bufferable for SDRAM */
	  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
	  MPU_InitStruct.BaseAddress = 0xC0000000;
	  MPU_InitStruct.Size = MPU_REGION_SIZE_256MB;
	  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
	  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
	  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
	  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
	  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
	  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
	  MPU_InitStruct.SubRegionDisable = 0x00;
	  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

	  HAL_MPU_ConfigRegion(&MPU_InitStruct);

	  /* Configure the MPU attributes as WT for SDRAM */
	  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
	  MPU_InitStruct.BaseAddress = 0xC0000000;
	  MPU_InitStruct.Size = MPU_REGION_SIZE_8MB;
	  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
	  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
	  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
	  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
	  MPU_InitStruct.Number = MPU_REGION_NUMBER3;
	  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
	  MPU_InitStruct.SubRegionDisable = 0x00;
	  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

	  HAL_MPU_ConfigRegion(&MPU_InitStruct);

	  /* Configure the MPU attributes as strongly ordred for QSPI (unused zone) */
	  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
	  MPU_InitStruct.BaseAddress = 0x90000000;
	  MPU_InitStruct.Size = MPU_REGION_SIZE_256MB;
	  MPU_InitStruct.AccessPermission = MPU_REGION_PRIV_RO;
	  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
	  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
	  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
	  MPU_InitStruct.Number = MPU_REGION_NUMBER4;
	  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
	  MPU_InitStruct.SubRegionDisable = 0x00;
	  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

	  HAL_MPU_ConfigRegion(&MPU_InitStruct);

	  /* Configure the MPU attributes as WT for QSPI (used 16Mbytes) */
	  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
	  MPU_InitStruct.BaseAddress = 0x90000000;
	  MPU_InitStruct.Size = MPU_REGION_SIZE_16MB;
	  MPU_InitStruct.AccessPermission = MPU_REGION_PRIV_RO;
	  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
	  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
	  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
	  MPU_InitStruct.Number = MPU_REGION_NUMBER5;
	  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
	  MPU_InitStruct.SubRegionDisable = 0x00;
	  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

	  HAL_MPU_ConfigRegion(&MPU_InitStruct);

	  /* Enable the MPU */
	  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}
int main(void)
{
	/* USER CODE BEGIN 1 */
	/* USER CODE END 1 */

	
	uint8_t SD_state = MSD_OK, res;
	



	MPU_Config();
	SCB_InvalidateICache();

	/* Enable branch prediction */
	SCB->CCR |= (1 <<18);
	__DSB();

	/* Invalidate I-Cache : ICIALLU register*/
	SCB_InvalidateICache();

	/* Enable I-Cache */
	SCB_EnableICache();

	SCB_InvalidateDCache();
	SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

